MikroElektronika/core_packages/PIC/XC8/def/PIC16F1619/mcu.h
extern volatile PIR4bits_t PIR4bits __at(0x013);
// bitfield macros
#define _PIR4_SMT1IF_POSN                                   0x0
#define _PIR4_SMT1IF_POSITION                               0x0
#define _PIR4_SMT1IF_SIZE                                   0x1
#define _PIR4_SMT1IF_LENGTH                                 0x1
#define _PIR4_SMT1IF_MASK                                   0x1
#define _PIR4_SMT1PRAIF_POSN                                0x1
#define _PIR4_SMT1PRAIF_POSITION                            0x1
#define _PIR4_SMT1PRAIF_SIZE                                0x1
#define _PIR4_SMT1PRAIF_LENGTH                              0x1
#define _PIR4_SMT1PRAIF_MASK                                0x2
#define _PIR4_SMT1PWAIF_POSN                                0x2
#define _PIR4_SMT1PWAIF_POSITION                            0x2
#define _PIR4_SMT1PWAIF_SIZE                                0x1
#define _PIR4_SMT1PWAIF_LENGTH                              0x1
#define _PIR4_SMT1PWAIF_MASK                                0x4
#define _PIR4_SMT2IF_POSN                                   0x3
#define _PIR4_SMT2IF_POSITION                               0x3
#define _PIR4_SMT2IF_SIZE                                   0x1
#define _PIR4_SMT2IF_LENGTH                                 0x1
#define _PIR4_SMT2IF_MASK                                   0x8
#define _PIR4_SMT2PRAIF_POSN                                0x4
#define _PIR4_SMT2PRAIF_POSITION                            0x4
#define _PIR4_SMT2PRAIF_SIZE                                0x1
#define _PIR4_SMT2PRAIF_LENGTH                              0x1
#define _PIR4_SMT2PRAIF_MASK                                0x10
#define _PIR4_SMT2PWAIF_POSN                                0x5
#define _PIR4_SMT2PWAIF_POSITION                            0x5
#define _PIR4_SMT2PWAIF_SIZE                                0x1
#define _PIR4_SMT2PWAIF_LENGTH                              0x1
#define _PIR4_SMT2PWAIF_MASK                                0x20
#define _PIR4_CRCIF_POSN                                    0x6
#define _PIR4_CRCIF_POSITION                                0x6
#define _PIR4_CRCIF_SIZE                                    0x1
#define _PIR4_CRCIF_LENGTH                                  0x1
#define _PIR4_CRCIF_MASK                                    0x40
#define _PIR4_SCANIF_POSN                                   0x7
#define _PIR4_SCANIF_POSITION                               0x7
#define _PIR4_SCANIF_SIZE                                   0x1
#define _PIR4_SCANIF_LENGTH                                 0x1
#define _PIR4_SCANIF_MASK                                   0x80

// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x014);
#ifndef _LIB_BUILD
asm("PIR5 equ 014h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PID1DIF                :1;
        unsigned PID1EIF                :1;
        unsigned AT1IF                  :1;
        unsigned                        :1;
        unsigned TMR5IF                 :1;
        unsigned TMR5GIF                :1;
        unsigned TMR3IF                 :1;
        unsigned TMR3GIF                :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x014);
// bitfield macros
#define _PIR5_PID1DIF_POSN                                  0x0
#define _PIR5_PID1DIF_POSITION                              0x0
#define _PIR5_PID1DIF_SIZE                                  0x1
#define _PIR5_PID1DIF_LENGTH                                0x1
#define _PIR5_PID1DIF_MASK                                  0x1
#define _PIR5_PID1EIF_POSN                                  0x1
#define _PIR5_PID1EIF_POSITION                              0x1
#define _PIR5_PID1EIF_SIZE                                  0x1
#define _PIR5_PID1EIF_LENGTH                                0x1
#define _PIR5_PID1EIF_MASK                                  0x2
#define _PIR5_AT1IF_POSN                                    0x2
#define _PIR5_AT1IF_POSITION                                0x2
#define _PIR5_AT1IF_SIZE                                    0x1
#define _PIR5_AT1IF_LENGTH                                  0x1
#define _PIR5_AT1IF_MASK                                    0x4
#define _PIR5_TMR5IF_POSN                                   0x4
#define _PIR5_TMR5IF_POSITION                               0x4
#define _PIR5_TMR5IF_SIZE                                   0x1
#define _PIR5_TMR5IF_LENGTH                                 0x1
#define _PIR5_TMR5IF_MASK                                   0x10
#define _PIR5_TMR5GIF_POSN                                  0x5
#define _PIR5_TMR5GIF_POSITION                              0x5
#define _PIR5_TMR5GIF_SIZE                                  0x1
#define _PIR5_TMR5GIF_LENGTH                                0x1
#define _PIR5_TMR5GIF_MASK                                  0x20
#define _PIR5_TMR3IF_POSN                                   0x6
#define _PIR5_TMR3IF_POSITION                               0x6
#define _PIR5_TMR3IF_SIZE                                   0x1
#define _PIR5_TMR3IF_LENGTH                                 0x1
#define _PIR5_TMR3IF_MASK                                   0x40
#define _PIR5_TMR3GIF_POSN                                  0x7
#define _PIR5_TMR3GIF_POSITION                              0x7
#define _PIR5_TMR3GIF_SIZE                                  0x1
#define _PIR5_TMR3GIF_LENGTH                                0x1
#define _PIR5_TMR3GIF_MASK                                  0x80

// Register: TMR0
#define TMR0 TMR0
extern volatile unsigned char           TMR0                __at(0x015);
#ifndef _LIB_BUILD
asm("TMR0 equ 015h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0                   :8;
    };
} TMR0bits_t;
extern volatile TMR0bits_t TMR0bits __at(0x015);
// bitfield macros
#define _TMR0_TMR0_POSN                                     0x0
#define _TMR0_TMR0_POSITION                                 0x0
#define _TMR0_TMR0_SIZE                                     0x8
#define _TMR0_TMR0_LENGTH                                   0x8
#define _TMR0_TMR0_MASK                                     0xFF

// Register: TMR1
#define TMR1 TMR1
extern volatile unsigned short          TMR1                __at(0x016);
#ifndef _LIB_BUILD
asm("TMR1 equ 016h");
#endif

// Register: TMR1L
#define TMR1L TMR1L
extern volatile unsigned char           TMR1L               __at(0x016);
#ifndef _LIB_BUILD
asm("TMR1L equ 016h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1L                  :8;
    };
} TMR1Lbits_t;
