MikroElektronika/core_packages/PIC/XC8/def/PIC16F1619/mcu.h
extern volatile SCANCON0bits_t SCANCON0bits __at(0x71C);
// bitfield macros
#define _SCANCON0_MODE_POSN                                 0x0
#define _SCANCON0_MODE_POSITION                             0x0
#define _SCANCON0_MODE_SIZE                                 0x2
#define _SCANCON0_MODE_LENGTH                               0x2
#define _SCANCON0_MODE_MASK                                 0x3
#define _SCANCON0_INTM_POSN                                 0x3
#define _SCANCON0_INTM_POSITION                             0x3
#define _SCANCON0_INTM_SIZE                                 0x1
#define _SCANCON0_INTM_LENGTH                               0x1
#define _SCANCON0_INTM_MASK                                 0x8
#define _SCANCON0_INVALID_POSN                              0x4
#define _SCANCON0_INVALID_POSITION                          0x4
#define _SCANCON0_INVALID_SIZE                              0x1
#define _SCANCON0_INVALID_LENGTH                            0x1
#define _SCANCON0_INVALID_MASK                              0x10
#define _SCANCON0_BUSY_POSN                                 0x5
#define _SCANCON0_BUSY_POSITION                             0x5
#define _SCANCON0_BUSY_SIZE                                 0x1
#define _SCANCON0_BUSY_LENGTH                               0x1
#define _SCANCON0_BUSY_MASK                                 0x20
#define _SCANCON0_SCANGO_POSN                               0x6
#define _SCANCON0_SCANGO_POSITION                           0x6
#define _SCANCON0_SCANGO_SIZE                               0x1
#define _SCANCON0_SCANGO_LENGTH                             0x1
#define _SCANCON0_SCANGO_MASK                               0x40
#define _SCANCON0_EN_POSN                                   0x7
#define _SCANCON0_EN_POSITION                               0x7
#define _SCANCON0_EN_SIZE                                   0x1
#define _SCANCON0_EN_LENGTH                                 0x1
#define _SCANCON0_EN_MASK                                   0x80
#define _SCANCON0_MODE0_POSN                                0x0
#define _SCANCON0_MODE0_POSITION                            0x0
#define _SCANCON0_MODE0_SIZE                                0x1
#define _SCANCON0_MODE0_LENGTH                              0x1
#define _SCANCON0_MODE0_MASK                                0x1
#define _SCANCON0_MODE1_POSN                                0x1
#define _SCANCON0_MODE1_POSITION                            0x1
#define _SCANCON0_MODE1_SIZE                                0x1
#define _SCANCON0_MODE1_LENGTH                              0x1
#define _SCANCON0_MODE1_MASK                                0x2
#define _SCANCON0_SCANMODE_POSN                             0x0
#define _SCANCON0_SCANMODE_POSITION                         0x0
#define _SCANCON0_SCANMODE_SIZE                             0x2
#define _SCANCON0_SCANMODE_LENGTH                           0x2
#define _SCANCON0_SCANMODE_MASK                             0x3
#define _SCANCON0_SCANINTM_POSN                             0x3
#define _SCANCON0_SCANINTM_POSITION                         0x3
#define _SCANCON0_SCANINTM_SIZE                             0x1
#define _SCANCON0_SCANINTM_LENGTH                           0x1
#define _SCANCON0_SCANINTM_MASK                             0x8
#define _SCANCON0_SCANINVALID_POSN                          0x4
#define _SCANCON0_SCANINVALID_POSITION                      0x4
#define _SCANCON0_SCANINVALID_SIZE                          0x1
#define _SCANCON0_SCANINVALID_LENGTH                        0x1
#define _SCANCON0_SCANINVALID_MASK                          0x10
#define _SCANCON0_SCANBUSY_POSN                             0x5
#define _SCANCON0_SCANBUSY_POSITION                         0x5
#define _SCANCON0_SCANBUSY_SIZE                             0x1
#define _SCANCON0_SCANBUSY_LENGTH                           0x1
#define _SCANCON0_SCANBUSY_MASK                             0x20
#define _SCANCON0_SCANEN_POSN                               0x7
#define _SCANCON0_SCANEN_POSITION                           0x7
#define _SCANCON0_SCANEN_SIZE                               0x1
#define _SCANCON0_SCANEN_LENGTH                             0x1
#define _SCANCON0_SCANEN_MASK                               0x80
#define _SCANCON0_SCANMODE0_POSN                            0x0
#define _SCANCON0_SCANMODE0_POSITION                        0x0
#define _SCANCON0_SCANMODE0_SIZE                            0x1
#define _SCANCON0_SCANMODE0_LENGTH                          0x1
#define _SCANCON0_SCANMODE0_MASK                            0x1
#define _SCANCON0_SCANMODE1_POSN                            0x1
#define _SCANCON0_SCANMODE1_POSITION                        0x1
#define _SCANCON0_SCANMODE1_SIZE                            0x1
#define _SCANCON0_SCANMODE1_LENGTH                          0x1
#define _SCANCON0_SCANMODE1_MASK                            0x2

// Register: SCANTRIG
#define SCANTRIG SCANTRIG
extern volatile unsigned char           SCANTRIG            __at(0x71D);
#ifndef _LIB_BUILD
asm("SCANTRIG equ 071Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TSEL                   :8;
    };
    struct {
        unsigned TSEL0                  :1;
        unsigned TSEL1                  :1;
        unsigned TSEL2                  :1;
        unsigned TSEL3                  :1;
    };
    struct {
        unsigned SCANTSEL               :8;
    };
    struct {
        unsigned SCANTSEL0              :1;
        unsigned SCANTSEL1              :1;
        unsigned SCANTSEL2              :1;
        unsigned SCANTSEL3              :1;
    };
} SCANTRIGbits_t;
extern volatile SCANTRIGbits_t SCANTRIGbits __at(0x71D);
// bitfield macros
#define _SCANTRIG_TSEL_POSN                                 0x0
#define _SCANTRIG_TSEL_POSITION                             0x0
#define _SCANTRIG_TSEL_SIZE                                 0x8
#define _SCANTRIG_TSEL_LENGTH                               0x8
#define _SCANTRIG_TSEL_MASK                                 0xFF
#define _SCANTRIG_TSEL0_POSN                                0x0
#define _SCANTRIG_TSEL0_POSITION                            0x0
#define _SCANTRIG_TSEL0_SIZE                                0x1
#define _SCANTRIG_TSEL0_LENGTH                              0x1
#define _SCANTRIG_TSEL0_MASK                                0x1
#define _SCANTRIG_TSEL1_POSN                                0x1
#define _SCANTRIG_TSEL1_POSITION                            0x1
#define _SCANTRIG_TSEL1_SIZE                                0x1
#define _SCANTRIG_TSEL1_LENGTH                              0x1
#define _SCANTRIG_TSEL1_MASK                                0x2
#define _SCANTRIG_TSEL2_POSN                                0x2
#define _SCANTRIG_TSEL2_POSITION                            0x2
#define _SCANTRIG_TSEL2_SIZE                                0x1
#define _SCANTRIG_TSEL2_LENGTH                              0x1
#define _SCANTRIG_TSEL2_MASK                                0x4
#define _SCANTRIG_TSEL3_POSN                                0x3
#define _SCANTRIG_TSEL3_POSITION                            0x3
#define _SCANTRIG_TSEL3_SIZE                                0x1
#define _SCANTRIG_TSEL3_LENGTH                              0x1
#define _SCANTRIG_TSEL3_MASK                                0x8
#define _SCANTRIG_SCANTSEL_POSN                             0x0
#define _SCANTRIG_SCANTSEL_POSITION                         0x0
#define _SCANTRIG_SCANTSEL_SIZE                             0x8
#define _SCANTRIG_SCANTSEL_LENGTH                           0x8
#define _SCANTRIG_SCANTSEL_MASK                             0xFF
#define _SCANTRIG_SCANTSEL0_POSN                            0x0
#define _SCANTRIG_SCANTSEL0_POSITION                        0x0
#define _SCANTRIG_SCANTSEL0_SIZE                            0x1
#define _SCANTRIG_SCANTSEL0_LENGTH                          0x1
#define _SCANTRIG_SCANTSEL0_MASK                            0x1
#define _SCANTRIG_SCANTSEL1_POSN                            0x1
#define _SCANTRIG_SCANTSEL1_POSITION                        0x1
#define _SCANTRIG_SCANTSEL1_SIZE                            0x1
#define _SCANTRIG_SCANTSEL1_LENGTH                          0x1
#define _SCANTRIG_SCANTSEL1_MASK                            0x2
#define _SCANTRIG_SCANTSEL2_POSN                            0x2
#define _SCANTRIG_SCANTSEL2_POSITION                        0x2
#define _SCANTRIG_SCANTSEL2_SIZE                            0x1
#define _SCANTRIG_SCANTSEL2_LENGTH                          0x1
#define _SCANTRIG_SCANTSEL2_MASK                            0x4
#define _SCANTRIG_SCANTSEL3_POSN                            0x3
#define _SCANTRIG_SCANTSEL3_POSITION                        0x3
#define _SCANTRIG_SCANTSEL3_SIZE                            0x1
#define _SCANTRIG_SCANTSEL3_LENGTH                          0x1
#define _SCANTRIG_SCANTSEL3_MASK                            0x8

// Register: CRCDAT
#define CRCDAT CRCDAT
extern volatile unsigned short          CRCDAT              __at(0x791);
#ifndef _LIB_BUILD
asm("CRCDAT equ 0791h");
#endif

// Register: CRCDATL
#define CRCDATL CRCDATL
extern volatile unsigned char           CRCDATL             __at(0x791);
#ifndef _LIB_BUILD
asm("CRCDATL equ 0791h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAT                    :8;
    };
    struct {
        unsigned DAT0                   :1;
        unsigned DAT1                   :1;
        unsigned DAT2                   :1;
        unsigned DAT3                   :1;
        unsigned DAT4                   :1;
        unsigned DAT5                   :1;
        unsigned DAT6                   :1;
        unsigned DAT7                   :1;
    };
    struct {
        unsigned CRCDAT                 :8;
    };
    struct {
        unsigned CRCDAT0                :1;
        unsigned CRCDAT1                :1;
        unsigned CRCDAT2                :1;
        unsigned CRCDAT3                :1;
        unsigned CRCDAT4                :1;
        unsigned CRCDAT5                :1;
        unsigned CRCDAT6                :1;
        unsigned CRDCDAT7               :1;
    };
} CRCDATLbits_t;
extern volatile CRCDATLbits_t CRCDATLbits __at(0x791);
// bitfield macros
#define _CRCDATL_DAT_POSN                                   0x0
#define _CRCDATL_DAT_POSITION                               0x0
#define _CRCDATL_DAT_SIZE                                   0x8
#define _CRCDATL_DAT_LENGTH                                 0x8
#define _CRCDATL_DAT_MASK                                   0xFF
#define _CRCDATL_DAT0_POSN                                  0x0
#define _CRCDATL_DAT0_POSITION                              0x0
#define _CRCDATL_DAT0_SIZE                                  0x1
#define _CRCDATL_DAT0_LENGTH                                0x1
#define _CRCDATL_DAT0_MASK                                  0x1
#define _CRCDATL_DAT1_POSN                                  0x1
#define _CRCDATL_DAT1_POSITION                              0x1
#define _CRCDATL_DAT1_SIZE                                  0x1
#define _CRCDATL_DAT1_LENGTH                                0x1
#define _CRCDATL_DAT1_MASK                                  0x2
#define _CRCDATL_DAT2_POSN                                  0x2
#define _CRCDATL_DAT2_POSITION                              0x2
#define _CRCDATL_DAT2_SIZE                                  0x1
#define _CRCDATL_DAT2_LENGTH                                0x1
#define _CRCDATL_DAT2_MASK                                  0x4
#define _CRCDATL_DAT3_POSN                                  0x3
#define _CRCDATL_DAT3_POSITION                              0x3
#define _CRCDATL_DAT3_SIZE                                  0x1
#define _CRCDATL_DAT3_LENGTH                                0x1
#define _CRCDATL_DAT3_MASK                                  0x8
#define _CRCDATL_DAT4_POSN                                  0x4
#define _CRCDATL_DAT4_POSITION                              0x4
#define _CRCDATL_DAT4_SIZE                                  0x1
#define _CRCDATL_DAT4_LENGTH                                0x1
#define _CRCDATL_DAT4_MASK                                  0x10
#define _CRCDATL_DAT5_POSN                                  0x5
#define _CRCDATL_DAT5_POSITION                              0x5
#define _CRCDATL_DAT5_SIZE                                  0x1
#define _CRCDATL_DAT5_LENGTH                                0x1
#define _CRCDATL_DAT5_MASK                                  0x20
#define _CRCDATL_DAT6_POSN                                  0x6
#define _CRCDATL_DAT6_POSITION                              0x6
#define _CRCDATL_DAT6_SIZE                                  0x1
#define _CRCDATL_DAT6_LENGTH                                0x1
#define _CRCDATL_DAT6_MASK                                  0x40
#define _CRCDATL_DAT7_POSN                                  0x7
#define _CRCDATL_DAT7_POSITION                              0x7
#define _CRCDATL_DAT7_SIZE                                  0x1
#define _CRCDATL_DAT7_LENGTH                                0x1
#define _CRCDATL_DAT7_MASK                                  0x80
#define _CRCDATL_CRCDAT_POSN                                0x0
#define _CRCDATL_CRCDAT_POSITION                            0x0
#define _CRCDATL_CRCDAT_SIZE                                0x8
#define _CRCDATL_CRCDAT_LENGTH                              0x8
#define _CRCDATL_CRCDAT_MASK                                0xFF
#define _CRCDATL_CRCDAT0_POSN                               0x0
#define _CRCDATL_CRCDAT0_POSITION                           0x0
#define _CRCDATL_CRCDAT0_SIZE                               0x1
#define _CRCDATL_CRCDAT0_LENGTH                             0x1
#define _CRCDATL_CRCDAT0_MASK                               0x1
#define _CRCDATL_CRCDAT1_POSN                               0x1
#define _CRCDATL_CRCDAT1_POSITION                           0x1
#define _CRCDATL_CRCDAT1_SIZE                               0x1
#define _CRCDATL_CRCDAT1_LENGTH                             0x1
#define _CRCDATL_CRCDAT1_MASK                               0x2
#define _CRCDATL_CRCDAT2_POSN                               0x2
#define _CRCDATL_CRCDAT2_POSITION                           0x2
#define _CRCDATL_CRCDAT2_SIZE                               0x1
#define _CRCDATL_CRCDAT2_LENGTH                             0x1
#define _CRCDATL_CRCDAT2_MASK                               0x4
#define _CRCDATL_CRCDAT3_POSN                               0x3
#define _CRCDATL_CRCDAT3_POSITION                           0x3
#define _CRCDATL_CRCDAT3_SIZE                               0x1
#define _CRCDATL_CRCDAT3_LENGTH                             0x1
#define _CRCDATL_CRCDAT3_MASK                               0x8
#define _CRCDATL_CRCDAT4_POSN                               0x4
#define _CRCDATL_CRCDAT4_POSITION                           0x4
#define _CRCDATL_CRCDAT4_SIZE                               0x1
#define _CRCDATL_CRCDAT4_LENGTH                             0x1
#define _CRCDATL_CRCDAT4_MASK                               0x10
#define _CRCDATL_CRCDAT5_POSN                               0x5
#define _CRCDATL_CRCDAT5_POSITION                           0x5
#define _CRCDATL_CRCDAT5_SIZE                               0x1
#define _CRCDATL_CRCDAT5_LENGTH                             0x1
#define _CRCDATL_CRCDAT5_MASK                               0x20
#define _CRCDATL_CRCDAT6_POSN                               0x6
#define _CRCDATL_CRCDAT6_POSITION                           0x6
#define _CRCDATL_CRCDAT6_SIZE                               0x1
#define _CRCDATL_CRCDAT6_LENGTH                             0x1
#define _CRCDATL_CRCDAT6_MASK                               0x40
#define _CRCDATL_CRDCDAT7_POSN                              0x7
#define _CRCDATL_CRDCDAT7_POSITION                          0x7
#define _CRCDATL_CRDCDAT7_SIZE                              0x1
#define _CRCDATL_CRDCDAT7_LENGTH                            0x1
#define _CRCDATL_CRDCDAT7_MASK                              0x80

