MikroElektronika/core_packages/PIC/XC8/def/PIC16F1619/mcu.h
// Register: SMT2CPRH
#define SMT2CPRH SMT2CPRH
extern volatile unsigned char           SMT2CPRH            __at(0xDA2);
#ifndef _LIB_BUILD
asm("SMT2CPRH equ 0DA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT2CPR                :8;
    };
    struct {
        unsigned SMT2CPR8               :1;
        unsigned SMT2CPR9               :1;
        unsigned SMT2CPR10              :1;
        unsigned SMT2CPR11              :1;
        unsigned SMT2CPR12              :1;
        unsigned SMT2CPR13              :1;
        unsigned SMT2CPR14              :1;
        unsigned SMT2CPR15              :1;
    };
} SMT2CPRHbits_t;
extern volatile SMT2CPRHbits_t SMT2CPRHbits __at(0xDA2);
// bitfield macros
#define _SMT2CPRH_SMT2CPR_POSN                              0x0
#define _SMT2CPRH_SMT2CPR_POSITION                          0x0
#define _SMT2CPRH_SMT2CPR_SIZE                              0x8
#define _SMT2CPRH_SMT2CPR_LENGTH                            0x8
#define _SMT2CPRH_SMT2CPR_MASK                              0xFF
#define _SMT2CPRH_SMT2CPR8_POSN                             0x0
#define _SMT2CPRH_SMT2CPR8_POSITION                         0x0
#define _SMT2CPRH_SMT2CPR8_SIZE                             0x1
#define _SMT2CPRH_SMT2CPR8_LENGTH                           0x1
#define _SMT2CPRH_SMT2CPR8_MASK                             0x1
#define _SMT2CPRH_SMT2CPR9_POSN                             0x1
#define _SMT2CPRH_SMT2CPR9_POSITION                         0x1
#define _SMT2CPRH_SMT2CPR9_SIZE                             0x1
#define _SMT2CPRH_SMT2CPR9_LENGTH                           0x1
#define _SMT2CPRH_SMT2CPR9_MASK                             0x2
#define _SMT2CPRH_SMT2CPR10_POSN                            0x2
#define _SMT2CPRH_SMT2CPR10_POSITION                        0x2
#define _SMT2CPRH_SMT2CPR10_SIZE                            0x1
#define _SMT2CPRH_SMT2CPR10_LENGTH                          0x1
#define _SMT2CPRH_SMT2CPR10_MASK                            0x4
#define _SMT2CPRH_SMT2CPR11_POSN                            0x3
#define _SMT2CPRH_SMT2CPR11_POSITION                        0x3
#define _SMT2CPRH_SMT2CPR11_SIZE                            0x1
#define _SMT2CPRH_SMT2CPR11_LENGTH                          0x1
#define _SMT2CPRH_SMT2CPR11_MASK                            0x8
#define _SMT2CPRH_SMT2CPR12_POSN                            0x4
#define _SMT2CPRH_SMT2CPR12_POSITION                        0x4
#define _SMT2CPRH_SMT2CPR12_SIZE                            0x1
#define _SMT2CPRH_SMT2CPR12_LENGTH                          0x1
#define _SMT2CPRH_SMT2CPR12_MASK                            0x10
#define _SMT2CPRH_SMT2CPR13_POSN                            0x5
#define _SMT2CPRH_SMT2CPR13_POSITION                        0x5
#define _SMT2CPRH_SMT2CPR13_SIZE                            0x1
#define _SMT2CPRH_SMT2CPR13_LENGTH                          0x1
#define _SMT2CPRH_SMT2CPR13_MASK                            0x20
#define _SMT2CPRH_SMT2CPR14_POSN                            0x6
#define _SMT2CPRH_SMT2CPR14_POSITION                        0x6
#define _SMT2CPRH_SMT2CPR14_SIZE                            0x1
#define _SMT2CPRH_SMT2CPR14_LENGTH                          0x1
#define _SMT2CPRH_SMT2CPR14_MASK                            0x40
#define _SMT2CPRH_SMT2CPR15_POSN                            0x7
#define _SMT2CPRH_SMT2CPR15_POSITION                        0x7
#define _SMT2CPRH_SMT2CPR15_SIZE                            0x1
#define _SMT2CPRH_SMT2CPR15_LENGTH                          0x1
#define _SMT2CPRH_SMT2CPR15_MASK                            0x80

// Register: SMT2CPRU
#define SMT2CPRU SMT2CPRU
extern volatile unsigned char           SMT2CPRU            __at(0xDA3);
#ifndef _LIB_BUILD
asm("SMT2CPRU equ 0DA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT2CPR                :8;
    };
    struct {
        unsigned SMT2CPR16              :1;
        unsigned SMT2CPR17              :1;
        unsigned SMT2CPR18              :1;
        unsigned SMT2CPR19              :1;
        unsigned SMT2CPR20              :1;
        unsigned SMT2CPR21              :1;
        unsigned SMT2CPR22              :1;
        unsigned SMT2CPR23              :1;
    };
} SMT2CPRUbits_t;
extern volatile SMT2CPRUbits_t SMT2CPRUbits __at(0xDA3);
// bitfield macros
#define _SMT2CPRU_SMT2CPR_POSN                              0x0
#define _SMT2CPRU_SMT2CPR_POSITION                          0x0
#define _SMT2CPRU_SMT2CPR_SIZE                              0x8
#define _SMT2CPRU_SMT2CPR_LENGTH                            0x8
#define _SMT2CPRU_SMT2CPR_MASK                              0xFF
#define _SMT2CPRU_SMT2CPR16_POSN                            0x0
#define _SMT2CPRU_SMT2CPR16_POSITION                        0x0
#define _SMT2CPRU_SMT2CPR16_SIZE                            0x1
#define _SMT2CPRU_SMT2CPR16_LENGTH                          0x1
#define _SMT2CPRU_SMT2CPR16_MASK                            0x1
#define _SMT2CPRU_SMT2CPR17_POSN                            0x1
#define _SMT2CPRU_SMT2CPR17_POSITION                        0x1
#define _SMT2CPRU_SMT2CPR17_SIZE                            0x1
#define _SMT2CPRU_SMT2CPR17_LENGTH                          0x1
#define _SMT2CPRU_SMT2CPR17_MASK                            0x2
#define _SMT2CPRU_SMT2CPR18_POSN                            0x2
#define _SMT2CPRU_SMT2CPR18_POSITION                        0x2
#define _SMT2CPRU_SMT2CPR18_SIZE                            0x1
#define _SMT2CPRU_SMT2CPR18_LENGTH                          0x1
#define _SMT2CPRU_SMT2CPR18_MASK                            0x4
#define _SMT2CPRU_SMT2CPR19_POSN                            0x3
#define _SMT2CPRU_SMT2CPR19_POSITION                        0x3
#define _SMT2CPRU_SMT2CPR19_SIZE                            0x1
#define _SMT2CPRU_SMT2CPR19_LENGTH                          0x1
#define _SMT2CPRU_SMT2CPR19_MASK                            0x8
#define _SMT2CPRU_SMT2CPR20_POSN                            0x4
#define _SMT2CPRU_SMT2CPR20_POSITION                        0x4
#define _SMT2CPRU_SMT2CPR20_SIZE                            0x1
#define _SMT2CPRU_SMT2CPR20_LENGTH                          0x1
#define _SMT2CPRU_SMT2CPR20_MASK                            0x10
#define _SMT2CPRU_SMT2CPR21_POSN                            0x5
#define _SMT2CPRU_SMT2CPR21_POSITION                        0x5
#define _SMT2CPRU_SMT2CPR21_SIZE                            0x1
#define _SMT2CPRU_SMT2CPR21_LENGTH                          0x1
#define _SMT2CPRU_SMT2CPR21_MASK                            0x20
#define _SMT2CPRU_SMT2CPR22_POSN                            0x6
#define _SMT2CPRU_SMT2CPR22_POSITION                        0x6
#define _SMT2CPRU_SMT2CPR22_SIZE                            0x1
#define _SMT2CPRU_SMT2CPR22_LENGTH                          0x1
#define _SMT2CPRU_SMT2CPR22_MASK                            0x40
#define _SMT2CPRU_SMT2CPR23_POSN                            0x7
#define _SMT2CPRU_SMT2CPR23_POSITION                        0x7
#define _SMT2CPRU_SMT2CPR23_SIZE                            0x1
#define _SMT2CPRU_SMT2CPR23_LENGTH                          0x1
#define _SMT2CPRU_SMT2CPR23_MASK                            0x80

// Register: SMT2CPW
#define SMT2CPW SMT2CPW
#ifndef __CCI__
extern volatile __uint24                SMT2CPW             __at(0xDA4);
#endif
#ifndef _LIB_BUILD
asm("SMT2CPW equ 0DA4h");
#endif

