MikroElektronika/core_packages/PIC/XC8/def/PIC16F1619/mcu.h
extern volatile CLCIN3PPSbits_t CLCIN3PPSbits __at(0xE2B);
// bitfield macros
#define _CLCIN3PPS_CLCIN3PPS_POSN                           0x0
#define _CLCIN3PPS_CLCIN3PPS_POSITION                       0x0
#define _CLCIN3PPS_CLCIN3PPS_SIZE                           0x5
#define _CLCIN3PPS_CLCIN3PPS_LENGTH                         0x5
#define _CLCIN3PPS_CLCIN3PPS_MASK                           0x1F
#define _CLCIN3PPS_CLCIN3PPS0_POSN                          0x0
#define _CLCIN3PPS_CLCIN3PPS0_POSITION                      0x0
#define _CLCIN3PPS_CLCIN3PPS0_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS0_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS0_MASK                          0x1
#define _CLCIN3PPS_CLCIN3PPS1_POSN                          0x1
#define _CLCIN3PPS_CLCIN3PPS1_POSITION                      0x1
#define _CLCIN3PPS_CLCIN3PPS1_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS1_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS1_MASK                          0x2
#define _CLCIN3PPS_CLCIN3PPS2_POSN                          0x2
#define _CLCIN3PPS_CLCIN3PPS2_POSITION                      0x2
#define _CLCIN3PPS_CLCIN3PPS2_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS2_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS2_MASK                          0x4
#define _CLCIN3PPS_CLCIN3PPS3_POSN                          0x3
#define _CLCIN3PPS_CLCIN3PPS3_POSITION                      0x3
#define _CLCIN3PPS_CLCIN3PPS3_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS3_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS3_MASK                          0x8
#define _CLCIN3PPS_CLCIN3PPS4_POSN                          0x4
#define _CLCIN3PPS_CLCIN3PPS4_POSITION                      0x4
#define _CLCIN3PPS_CLCIN3PPS4_SIZE                          0x1
#define _CLCIN3PPS_CLCIN3PPS4_LENGTH                        0x1
#define _CLCIN3PPS_CLCIN3PPS4_MASK                          0x10

// Register: SMT2SIGPPS
#define SMT2SIGPPS SMT2SIGPPS
extern volatile unsigned char           SMT2SIGPPS          __at(0xE2C);
#ifndef _LIB_BUILD
asm("SMT2SIGPPS equ 0E2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT2SIGPPS             :5;
    };
    struct {
        unsigned SMT2SIGPPS0            :1;
        unsigned SMT2SIGPPS1            :1;
        unsigned SMT2SIGPPS2            :1;
        unsigned SMT2SIGPPS3            :1;
        unsigned SMT2SIGPPS4            :1;
    };
} SMT2SIGPPSbits_t;
extern volatile SMT2SIGPPSbits_t SMT2SIGPPSbits __at(0xE2C);
// bitfield macros
#define _SMT2SIGPPS_SMT2SIGPPS_POSN                         0x0
#define _SMT2SIGPPS_SMT2SIGPPS_POSITION                     0x0
#define _SMT2SIGPPS_SMT2SIGPPS_SIZE                         0x5
#define _SMT2SIGPPS_SMT2SIGPPS_LENGTH                       0x5
#define _SMT2SIGPPS_SMT2SIGPPS_MASK                         0x1F
#define _SMT2SIGPPS_SMT2SIGPPS0_POSN                        0x0
#define _SMT2SIGPPS_SMT2SIGPPS0_POSITION                    0x0
#define _SMT2SIGPPS_SMT2SIGPPS0_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS0_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS0_MASK                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_POSN                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_POSITION                    0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_MASK                        0x2
#define _SMT2SIGPPS_SMT2SIGPPS2_POSN                        0x2
#define _SMT2SIGPPS_SMT2SIGPPS2_POSITION                    0x2
#define _SMT2SIGPPS_SMT2SIGPPS2_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS2_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS2_MASK                        0x4
#define _SMT2SIGPPS_SMT2SIGPPS3_POSN                        0x3
#define _SMT2SIGPPS_SMT2SIGPPS3_POSITION                    0x3
#define _SMT2SIGPPS_SMT2SIGPPS3_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS3_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS3_MASK                        0x8
#define _SMT2SIGPPS_SMT2SIGPPS4_POSN                        0x4
#define _SMT2SIGPPS_SMT2SIGPPS4_POSITION                    0x4
#define _SMT2SIGPPS_SMT2SIGPPS4_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS4_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS4_MASK                        0x10

// Register: SMT2WINPPS
#define SMT2WINPPS SMT2WINPPS
extern volatile unsigned char           SMT2WINPPS          __at(0xE2D);
#ifndef _LIB_BUILD
asm("SMT2WINPPS equ 0E2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT2WINPPS             :5;
    };
    struct {
        unsigned SMT2WINPPS0            :1;
        unsigned SMT2WINPPS1            :1;
        unsigned SMT2WINPPS2            :1;
        unsigned SMT2WINPPS3            :1;
        unsigned SMT2WINPPS4            :1;
    };
} SMT2WINPPSbits_t;
extern volatile SMT2WINPPSbits_t SMT2WINPPSbits __at(0xE2D);
// bitfield macros
#define _SMT2WINPPS_SMT2WINPPS_POSN                         0x0
#define _SMT2WINPPS_SMT2WINPPS_POSITION                     0x0
#define _SMT2WINPPS_SMT2WINPPS_SIZE                         0x5
#define _SMT2WINPPS_SMT2WINPPS_LENGTH                       0x5
#define _SMT2WINPPS_SMT2WINPPS_MASK                         0x1F
#define _SMT2WINPPS_SMT2WINPPS0_POSN                        0x0
#define _SMT2WINPPS_SMT2WINPPS0_POSITION                    0x0
#define _SMT2WINPPS_SMT2WINPPS0_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS0_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS0_MASK                        0x1
#define _SMT2WINPPS_SMT2WINPPS1_POSN                        0x1
#define _SMT2WINPPS_SMT2WINPPS1_POSITION                    0x1
#define _SMT2WINPPS_SMT2WINPPS1_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS1_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS1_MASK                        0x2
#define _SMT2WINPPS_SMT2WINPPS2_POSN                        0x2
#define _SMT2WINPPS_SMT2WINPPS2_POSITION                    0x2
#define _SMT2WINPPS_SMT2WINPPS2_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS2_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS2_MASK                        0x4
#define _SMT2WINPPS_SMT2WINPPS3_POSN                        0x3
#define _SMT2WINPPS_SMT2WINPPS3_POSITION                    0x3
#define _SMT2WINPPS_SMT2WINPPS3_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS3_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS3_MASK                        0x8
#define _SMT2WINPPS_SMT2WINPPS4_POSN                        0x4
#define _SMT2WINPPS_SMT2WINPPS4_POSITION                    0x4
#define _SMT2WINPPS_SMT2WINPPS4_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS4_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS4_MASK                        0x10

// Register: ATCC3PPS
#define ATCC3PPS ATCC3PPS
extern volatile unsigned char           ATCC3PPS            __at(0xE2E);
#ifndef _LIB_BUILD
asm("ATCC3PPS equ 0E2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ATCC3PPS               :5;
    };
    struct {
        unsigned ATCC3PPS0              :1;
        unsigned ATCC3PPS1              :1;
        unsigned ATCC3PPS2              :1;
        unsigned ATCC3PPS3              :1;
        unsigned ATCC3PPS4              :1;
    };
} ATCC3PPSbits_t;
extern volatile ATCC3PPSbits_t ATCC3PPSbits __at(0xE2E);
// bitfield macros
#define _ATCC3PPS_ATCC3PPS_POSN                             0x0
#define _ATCC3PPS_ATCC3PPS_POSITION                         0x0
#define _ATCC3PPS_ATCC3PPS_SIZE                             0x5
#define _ATCC3PPS_ATCC3PPS_LENGTH                           0x5
#define _ATCC3PPS_ATCC3PPS_MASK                             0x1F
#define _ATCC3PPS_ATCC3PPS0_POSN                            0x0
#define _ATCC3PPS_ATCC3PPS0_POSITION                        0x0
#define _ATCC3PPS_ATCC3PPS0_SIZE                            0x1
#define _ATCC3PPS_ATCC3PPS0_LENGTH                          0x1
#define _ATCC3PPS_ATCC3PPS0_MASK                            0x1
#define _ATCC3PPS_ATCC3PPS1_POSN                            0x1
#define _ATCC3PPS_ATCC3PPS1_POSITION                        0x1
#define _ATCC3PPS_ATCC3PPS1_SIZE                            0x1
#define _ATCC3PPS_ATCC3PPS1_LENGTH                          0x1
#define _ATCC3PPS_ATCC3PPS1_MASK                            0x2
#define _ATCC3PPS_ATCC3PPS2_POSN                            0x2
#define _ATCC3PPS_ATCC3PPS2_POSITION                        0x2
#define _ATCC3PPS_ATCC3PPS2_SIZE                            0x1
#define _ATCC3PPS_ATCC3PPS2_LENGTH                          0x1
#define _ATCC3PPS_ATCC3PPS2_MASK                            0x4
#define _ATCC3PPS_ATCC3PPS3_POSN                            0x3
#define _ATCC3PPS_ATCC3PPS3_POSITION                        0x3
#define _ATCC3PPS_ATCC3PPS3_SIZE                            0x1
#define _ATCC3PPS_ATCC3PPS3_LENGTH                          0x1
#define _ATCC3PPS_ATCC3PPS3_MASK                            0x8
#define _ATCC3PPS_ATCC3PPS4_POSN                            0x4
#define _ATCC3PPS_ATCC3PPS4_POSITION                        0x4
#define _ATCC3PPS_ATCC3PPS4_SIZE                            0x1
#define _ATCC3PPS_ATCC3PPS4_LENGTH                          0x1
#define _ATCC3PPS_ATCC3PPS4_MASK                            0x10

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0xE90);
#ifndef _LIB_BUILD
asm("RA0PPS equ 0E90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
        unsigned RA0PPS4                :1;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0xE90);
// bitfield macros
#define _RA0PPS_RA0PPS0_POSN                                0x0
#define _RA0PPS_RA0PPS0_POSITION                            0x0
#define _RA0PPS_RA0PPS0_SIZE                                0x1
#define _RA0PPS_RA0PPS0_LENGTH                              0x1
#define _RA0PPS_RA0PPS0_MASK                                0x1
#define _RA0PPS_RA0PPS1_POSN                                0x1
#define _RA0PPS_RA0PPS1_POSITION                            0x1
#define _RA0PPS_RA0PPS1_SIZE                                0x1
#define _RA0PPS_RA0PPS1_LENGTH                              0x1
#define _RA0PPS_RA0PPS1_MASK                                0x2
#define _RA0PPS_RA0PPS2_POSN                                0x2
#define _RA0PPS_RA0PPS2_POSITION                            0x2
#define _RA0PPS_RA0PPS2_SIZE                                0x1
#define _RA0PPS_RA0PPS2_LENGTH                              0x1
#define _RA0PPS_RA0PPS2_MASK                                0x4
#define _RA0PPS_RA0PPS3_POSN                                0x3
#define _RA0PPS_RA0PPS3_POSITION                            0x3
#define _RA0PPS_RA0PPS3_SIZE                                0x1
#define _RA0PPS_RA0PPS3_LENGTH                              0x1
#define _RA0PPS_RA0PPS3_MASK                                0x8
#define _RA0PPS_RA0PPS4_POSN                                0x4
#define _RA0PPS_RA0PPS4_POSITION                            0x4
#define _RA0PPS_RA0PPS4_SIZE                                0x1
#define _RA0PPS_RA0PPS4_LENGTH                              0x1
#define _RA0PPS_RA0PPS4_MASK                                0x10

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0xE91);
#ifndef _LIB_BUILD
asm("RA1PPS equ 0E91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS0                :1;
        unsigned RA1PPS1                :1;
        unsigned RA1PPS2                :1;
        unsigned RA1PPS3                :1;
        unsigned RA1PPS4                :1;
    };
} RA1PPSbits_t;
