MikroElektronika/core_packages/PIC/XC8/def/PIC16F1619/mcu.h
#define                                 INTPPS1_bit         _BIT_ACCESS(INTPPS,1)
// INTPPS<INTPPS2>
extern volatile __bit                   INTPPS2             __at(0x7082);	// @ (0xE10 * 8 + 2)
#define                                 INTPPS2_bit         _BIT_ACCESS(INTPPS,2)
// INTPPS<INTPPS3>
extern volatile __bit                   INTPPS3             __at(0x7083);	// @ (0xE10 * 8 + 3)
#define                                 INTPPS3_bit         _BIT_ACCESS(INTPPS,3)
// INTPPS<INTPPS4>
extern volatile __bit                   INTPPS4             __at(0x7084);	// @ (0xE10 * 8 + 4)
#define                                 INTPPS4_bit         _BIT_ACCESS(INTPPS,4)
// SCANCON0<INVALID>
extern volatile __bit                   INVALID             __at(0x38E4);	// @ (0x71C * 8 + 4)
#define                                 INVALID_bit         _BIT_ACCESS(SCANCON0,4)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x1C98);	// @ (0x393 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x1C99);	// @ (0x393 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x1C9A);	// @ (0x393 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x1C9B);	// @ (0x393 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x1C9C);	// @ (0x393 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x1C9D);	// @ (0x393 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x1C90);	// @ (0x392 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x1C91);	// @ (0x392 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x1C92);	// @ (0x392 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x1C93);	// @ (0x392 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x1C94);	// @ (0x392 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x1C95);	// @ (0x392 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x1C88);	// @ (0x391 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x1C89);	// @ (0x391 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x1C8A);	// @ (0x391 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x1C8B);	// @ (0x391 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x1C8C);	// @ (0x391 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x1C8D);	// @ (0x391 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCBF<IOCBF4>
extern volatile __bit                   IOCBF4              __at(0x1CB4);	// @ (0x396 * 8 + 4)
#define                                 IOCBF4_bit          _BIT_ACCESS(IOCBF,4)
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0x1CB5);	// @ (0x396 * 8 + 5)
#define                                 IOCBF5_bit          _BIT_ACCESS(IOCBF,5)
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0x1CB6);	// @ (0x396 * 8 + 6)
#define                                 IOCBF6_bit          _BIT_ACCESS(IOCBF,6)
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0x1CB7);	// @ (0x396 * 8 + 7)
#define                                 IOCBF7_bit          _BIT_ACCESS(IOCBF,7)
// IOCBN<IOCBN4>
extern volatile __bit                   IOCBN4              __at(0x1CAC);	// @ (0x395 * 8 + 4)
#define                                 IOCBN4_bit          _BIT_ACCESS(IOCBN,4)
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0x1CAD);	// @ (0x395 * 8 + 5)
#define                                 IOCBN5_bit          _BIT_ACCESS(IOCBN,5)
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0x1CAE);	// @ (0x395 * 8 + 6)
#define                                 IOCBN6_bit          _BIT_ACCESS(IOCBN,6)
// IOCBN<IOCBN7>
extern volatile __bit                   IOCBN7              __at(0x1CAF);	// @ (0x395 * 8 + 7)
#define                                 IOCBN7_bit          _BIT_ACCESS(IOCBN,7)
// IOCBP<IOCBP4>
extern volatile __bit                   IOCBP4              __at(0x1CA4);	// @ (0x394 * 8 + 4)
#define                                 IOCBP4_bit          _BIT_ACCESS(IOCBP,4)
// IOCBP<IOCBP5>
extern volatile __bit                   IOCBP5              __at(0x1CA5);	// @ (0x394 * 8 + 5)
#define                                 IOCBP5_bit          _BIT_ACCESS(IOCBP,5)
// IOCBP<IOCBP6>
extern volatile __bit                   IOCBP6              __at(0x1CA6);	// @ (0x394 * 8 + 6)
#define                                 IOCBP6_bit          _BIT_ACCESS(IOCBP,6)
// IOCBP<IOCBP7>
extern volatile __bit                   IOCBP7              __at(0x1CA7);	// @ (0x394 * 8 + 7)
#define                                 IOCBP7_bit          _BIT_ACCESS(IOCBP,7)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x1CC8);	// @ (0x399 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x1CC9);	// @ (0x399 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0x1CCA);	// @ (0x399 * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x1CCB);	// @ (0x399 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x1CCC);	// @ (0x399 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x1CCD);	// @ (0x399 * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCF<IOCCF6>
extern volatile __bit                   IOCCF6              __at(0x1CCE);	// @ (0x399 * 8 + 6)
#define                                 IOCCF6_bit          _BIT_ACCESS(IOCCF,6)
// IOCCF<IOCCF7>
extern volatile __bit                   IOCCF7              __at(0x1CCF);	// @ (0x399 * 8 + 7)
#define                                 IOCCF7_bit          _BIT_ACCESS(IOCCF,7)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0x1CC0);	// @ (0x398 * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0x1CC1);	// @ (0x398 * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN2>
extern volatile __bit                   IOCCN2              __at(0x1CC2);	// @ (0x398 * 8 + 2)
#define                                 IOCCN2_bit          _BIT_ACCESS(IOCCN,2)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0x1CC3);	// @ (0x398 * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0x1CC4);	// @ (0x398 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0x1CC5);	// @ (0x398 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCN<IOCCN6>
extern volatile __bit                   IOCCN6              __at(0x1CC6);	// @ (0x398 * 8 + 6)
#define                                 IOCCN6_bit          _BIT_ACCESS(IOCCN,6)
// IOCCN<IOCCN7>
extern volatile __bit                   IOCCN7              __at(0x1CC7);	// @ (0x398 * 8 + 7)
#define                                 IOCCN7_bit          _BIT_ACCESS(IOCCN,7)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0x1CB8);	// @ (0x397 * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0x1CB9);	// @ (0x397 * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP2>
extern volatile __bit                   IOCCP2              __at(0x1CBA);	// @ (0x397 * 8 + 2)
#define                                 IOCCP2_bit          _BIT_ACCESS(IOCCP,2)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0x1CBB);	// @ (0x397 * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x1CBC);	// @ (0x397 * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x1CBD);	// @ (0x397 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0x1CBE);	// @ (0x397 * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// IOCCP<IOCCP7>
extern volatile __bit                   IOCCP7              __at(0x1CBF);	// @ (0x397 * 8 + 7)
#define                                 IOCCP7_bit          _BIT_ACCESS(IOCCP,7)
// INTCON<IOCIE>
extern volatile __bit                   IOCIE               __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 IOCIE_bit           _BIT_ACCESS(INTCON,3)
// INTCON<IOCIF>
extern volatile __bit                   IOCIF               __at(0x58);	// @ (0xB * 8 + 0)
#define                                 IOCIF_bit           _BIT_ACCESS(INTCON,0)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,3)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x4CC);	// @ (0x99 * 8 + 4)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x4CD);	// @ (0x99 * 8 + 5)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF3>
extern volatile __bit                   IRCF3               __at(0x4CE);	// @ (0x99 * 8 + 6)
#define                                 IRCF3_bit           _BIT_ACCESS(OSCCON,6)
// CWG1ISM<IS0>
extern volatile __bit                   IS0                 __at(0x34D0);	// @ (0x69A * 8 + 0)
#define                                 IS0_bit             _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<IS1>
extern volatile __bit                   IS1                 __at(0x34D1);	// @ (0x69A * 8 + 1)
#define                                 IS1_bit             _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<IS2>
extern volatile __bit                   IS2                 __at(0x34D2);	// @ (0x69A * 8 + 2)
#define                                 IS2_bit             _BIT_ACCESS(CWG1ISM,2)
// CWG1ISM<IS3>
extern volatile __bit                   IS3                 __at(0x34D3);	// @ (0x69A * 8 + 3)
#define                                 IS3_bit             _BIT_ACCESS(CWG1ISM,3)
// PID1K1L<K10>
extern volatile __bit                   K10                 __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 K10_bit             _BIT_ACCESS(PID1K1L,0)
// PID1K1L<K11>
extern volatile __bit                   K11                 __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 K11_bit             _BIT_ACCESS(PID1K1L,1)
// PID1K1H<K110>
extern volatile __bit                   K110                __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 K110_bit            _BIT_ACCESS(PID1K1H,2)
// PID1K1H<K111>
extern volatile __bit                   K111                __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 K111_bit            _BIT_ACCESS(PID1K1H,3)
// PID1K1H<K112>
extern volatile __bit                   K112                __at(0x2C8C);	// @ (0x591 * 8 + 4)
#define                                 K112_bit            _BIT_ACCESS(PID1K1H,4)
// PID1K1H<K113>
extern volatile __bit                   K113                __at(0x2C8D);	// @ (0x591 * 8 + 5)
#define                                 K113_bit            _BIT_ACCESS(PID1K1H,5)
// PID1K1H<K114>
extern volatile __bit                   K114                __at(0x2C8E);	// @ (0x591 * 8 + 6)
#define                                 K114_bit            _BIT_ACCESS(PID1K1H,6)
// PID1K1H<K115>
extern volatile __bit                   K115                __at(0x2C8F);	// @ (0x591 * 8 + 7)
#define                                 K115_bit            _BIT_ACCESS(PID1K1H,7)
// PID1K1L<K12>
extern volatile __bit                   K12                 __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 K12_bit             _BIT_ACCESS(PID1K1L,2)
// PID1K1L<K13>
extern volatile __bit                   K13                 __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 K13_bit             _BIT_ACCESS(PID1K1L,3)
// PID1K1L<K14>
extern volatile __bit                   K14                 __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 K14_bit             _BIT_ACCESS(PID1K1L,4)
// PID1K1L<K15>
extern volatile __bit                   K15                 __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 K15_bit             _BIT_ACCESS(PID1K1L,5)
// PID1K1L<K16>
extern volatile __bit                   K16                 __at(0x2C86);	// @ (0x590 * 8 + 6)
#define                                 K16_bit             _BIT_ACCESS(PID1K1L,6)
// PID1K1L<K17>
extern volatile __bit                   K17                 __at(0x2C87);	// @ (0x590 * 8 + 7)
#define                                 K17_bit             _BIT_ACCESS(PID1K1L,7)
// PID1K1H<K18>
extern volatile __bit                   K18                 __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 K18_bit             _BIT_ACCESS(PID1K1H,0)
// PID1K1H<K19>
extern volatile __bit                   K19                 __at(0x2C89);	// @ (0x591 * 8 + 1)
#define                                 K19_bit             _BIT_ACCESS(PID1K1H,1)
// PID1K2L<K20>
extern volatile __bit                   K20                 __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 K20_bit             _BIT_ACCESS(PID1K2L,0)
// PID1K2L<K21>
extern volatile __bit                   K21                 __at(0x2C91);	// @ (0x592 * 8 + 1)
#define                                 K21_bit             _BIT_ACCESS(PID1K2L,1)
// PID1K2H<K210>
extern volatile __bit                   K210                __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 K210_bit            _BIT_ACCESS(PID1K2H,2)
// PID1K2H<K211>
extern volatile __bit                   K211                __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 K211_bit            _BIT_ACCESS(PID1K2H,3)
// PID1K2H<K212>
extern volatile __bit                   K212                __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 K212_bit            _BIT_ACCESS(PID1K2H,4)
// PID1K2H<K213>
extern volatile __bit                   K213                __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 K213_bit            _BIT_ACCESS(PID1K2H,5)
// PID1K2H<K214>
extern volatile __bit                   K214                __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 K214_bit            _BIT_ACCESS(PID1K2H,6)
// PID1K2H<K215>
extern volatile __bit                   K215                __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 K215_bit            _BIT_ACCESS(PID1K2H,7)
// PID1K2L<K22>
extern volatile __bit                   K22                 __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 K22_bit             _BIT_ACCESS(PID1K2L,2)
// PID1K2L<K23>
extern volatile __bit                   K23                 __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 K23_bit             _BIT_ACCESS(PID1K2L,3)
// PID1K2L<K24>
extern volatile __bit                   K24                 __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 K24_bit             _BIT_ACCESS(PID1K2L,4)
// PID1K2L<K25>
extern volatile __bit                   K25                 __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 K25_bit             _BIT_ACCESS(PID1K2L,5)
// PID1K2L<K26>
extern volatile __bit                   K26                 __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 K26_bit             _BIT_ACCESS(PID1K2L,6)
// PID1K2L<K27>
extern volatile __bit                   K27                 __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 K27_bit             _BIT_ACCESS(PID1K2L,7)
// PID1K2H<K28>
extern volatile __bit                   K28                 __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 K28_bit             _BIT_ACCESS(PID1K2H,0)
// PID1K2H<K29>
extern volatile __bit                   K29                 __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 K29_bit             _BIT_ACCESS(PID1K2H,1)
// PID1K3L<K30>
extern volatile __bit                   K30                 __at(0x2CA0);	// @ (0x594 * 8 + 0)
#define                                 K30_bit             _BIT_ACCESS(PID1K3L,0)
// PID1K3L<K31>
extern volatile __bit                   K31                 __at(0x2CA1);	// @ (0x594 * 8 + 1)
#define                                 K31_bit             _BIT_ACCESS(PID1K3L,1)
// PID1K3H<K310>
extern volatile __bit                   K310                __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 K310_bit            _BIT_ACCESS(PID1K3H,2)
// PID1K3H<K311>
extern volatile __bit                   K311                __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 K311_bit            _BIT_ACCESS(PID1K3H,3)
// PID1K3H<K312>
extern volatile __bit                   K312                __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 K312_bit            _BIT_ACCESS(PID1K3H,4)
// PID1K3H<K313>
extern volatile __bit                   K313                __at(0x2CAD);	// @ (0x595 * 8 + 5)
#define                                 K313_bit            _BIT_ACCESS(PID1K3H,5)
// PID1K3H<K314>
extern volatile __bit                   K314                __at(0x2CAE);	// @ (0x595 * 8 + 6)
#define                                 K314_bit            _BIT_ACCESS(PID1K3H,6)
// PID1K3H<K315>
extern volatile __bit                   K315                __at(0x2CAF);	// @ (0x595 * 8 + 7)
#define                                 K315_bit            _BIT_ACCESS(PID1K3H,7)
// PID1K3L<K32>
extern volatile __bit                   K32                 __at(0x2CA2);	// @ (0x594 * 8 + 2)
#define                                 K32_bit             _BIT_ACCESS(PID1K3L,2)
// PID1K3L<K33>
extern volatile __bit                   K33                 __at(0x2CA3);	// @ (0x594 * 8 + 3)
#define                                 K33_bit             _BIT_ACCESS(PID1K3L,3)
// PID1K3L<K34>
extern volatile __bit                   K34                 __at(0x2CA4);	// @ (0x594 * 8 + 4)
#define                                 K34_bit             _BIT_ACCESS(PID1K3L,4)
// PID1K3L<K35>
extern volatile __bit                   K35                 __at(0x2CA5);	// @ (0x594 * 8 + 5)
#define                                 K35_bit             _BIT_ACCESS(PID1K3L,5)
// PID1K3L<K36>
extern volatile __bit                   K36                 __at(0x2CA6);	// @ (0x594 * 8 + 6)
#define                                 K36_bit             _BIT_ACCESS(PID1K3L,6)
// PID1K3L<K37>
extern volatile __bit                   K37                 __at(0x2CA7);	// @ (0x594 * 8 + 7)
#define                                 K37_bit             _BIT_ACCESS(PID1K3L,7)
// PID1K3H<K38>
extern volatile __bit                   K38                 __at(0x2CA8);	// @ (0x595 * 8 + 0)
#define                                 K38_bit             _BIT_ACCESS(PID1K3H,0)
// PID1K3H<K39>
extern volatile __bit                   K39                 __at(0x2CA9);	// @ (0x595 * 8 + 1)
#define                                 K39_bit             _BIT_ACCESS(PID1K3H,1)
// SCANLADRH<LADR10>
extern volatile __bit                   LADR10              __at(0x38CA);	// @ (0x719 * 8 + 2)
#define                                 LADR10_bit          _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<LADR11>
extern volatile __bit                   LADR11              __at(0x38CB);	// @ (0x719 * 8 + 3)
#define                                 LADR11_bit          _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<LADR12>
extern volatile __bit                   LADR12              __at(0x38CC);	// @ (0x719 * 8 + 4)
#define                                 LADR12_bit          _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<LADR13>
extern volatile __bit                   LADR13              __at(0x38CD);	// @ (0x719 * 8 + 5)
#define                                 LADR13_bit          _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<LADR14>
extern volatile __bit                   LADR14              __at(0x38CE);	// @ (0x719 * 8 + 6)
#define                                 LADR14_bit          _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<LADR15>
extern volatile __bit                   LADR15              __at(0x38CF);	// @ (0x719 * 8 + 7)
#define                                 LADR15_bit          _BIT_ACCESS(SCANLADRH,7)
// SCANLADRL<LADR2>
extern volatile __bit                   LADR2               __at(0x38C2);	// @ (0x718 * 8 + 2)
#define                                 LADR2_bit           _BIT_ACCESS(SCANLADRL,2)
// SCANLADRL<LADR3>
